-- phpMyAdmin SQL Dump
-- version 4.6.6
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: 2020-09-14 12:41:11
-- 服务器版本： 5.7.17-log
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `vue-db`
--

-- --------------------------------------------------------

--
-- 表的结构 `admin`
--

CREATE TABLE `admin` (
  `user_id` int(10) NOT NULL,
  `user_account` varchar(20) NOT NULL,
  `user_name` varchar(10) DEFAULT NULL,
  `password` varchar(20) NOT NULL,
  `user_sex` varchar(10) NOT NULL DEFAULT '猛男百分百',
  `user_addrees` varchar(25) DEFAULT NULL,
  `user_sign` varchar(200) DEFAULT '这个人很懒，什么也没有留下',
  `has_head` int(11) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `admin`
--

INSERT INTO `admin` (`user_id`, `user_account`, `user_name`, `password`, `user_sex`, `user_addrees`, `user_sign`, `has_head`) VALUES
(1, '13030297887', '六饭堂主', '2431299liang', '百分百猛男', '广东云浮', '哦吼吼吼吼', 2);

-- --------------------------------------------------------

--
-- 表的结构 `books`
--

CREATE TABLE `books` (
  `isbn` char(13) NOT NULL,
  `author` char(80) DEFAULT NULL,
  `title` char(100) DEFAULT NULL,
  `catid` int(10) NOT NULL,
  `price` float(6,2) NOT NULL,
  `description` varchar(255) DEFAULT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `books`
--

INSERT INTO `books` (`isbn`, `author`, `title`, `catid`, `price`, `description`) VALUES
('9787534075711', ' 川原砾', '刀剑神域21 Alicization', 2, 35.00, '桐人、亚丝娜、爱丽丝终于从Under World回归到现实世界，一个月后的某一天，三人如常登录ALO时却被卷入一场突如其来的巨大异变，连同新生艾恩葛朗特一起被转移到了一个全新的游戏世界——Unital Ring。他们的能力值和道具被全部重置，也无法使用从ALO继承的装备，而Unital Ring是一个沙盒式生存游戏，衣食住行和武器装备都需要自己解决，其他被卷入这个世界的玩家也成了敌人——他们将如何渡过这个难关？'),
('9787513330480', '丸山黄金', 'Overlord 十二册全套', 3, 495.00, '原作小说《OVERLORD》于2012年出版，一经问世便备受读者喜爱，其同名改编动画于2015年上映，同样大受欢迎，并于2018年制作了两部续作。在原作以及衍生作品有如此高人气的背景下，本书应运而生，极为详尽地展现了动画《OVERLORD》的方方面面，成为日本亚马逊等网络销售平台的热门书籍之一。本书为动画第1季的设定资料集，主要收录了大量动画登场角色的彩色设定图、线稿、透视图和场景的概念设定图，以及原作者与动画制作团队的对谈等。全书不仅能满足粉丝的阅读和收藏需求，也可以让绘画爱好者进行学习参考。'),
('9789863652427', 'アネコ ユサギ', '盾之勇者成名录 小说 1-20册套装', 4, 1162.00, '作為盾之勇者被召喚至異世界的岩谷尚文。\r\n\r\n誰知展開冒險才到第三天就被戰友背叛，一口氣失去了身為勇者的名聲及所有盤纏。……為什麼只有我碰上這種倒楣事啊！？不信任、疑念、猜忌，世界上的所有人事物都是仇敵！尚文陷入再也無法相信他人的狀態，此時卻見一名少女出現在他面前……！？在苦惱的盡頭，他所得到的究竟是什麼東西呢！？\r\n\r\n這是描述一名男子從絕望深淵奮發向上之軌跡的成名奇幻小說！'),
('9787539767741', '渡航', '我的青春恋爱物语喜剧果然有问题全套', 5, 229.00, '主人公高中二年级学生比企谷八幡认为讴歌青春的人只是打着青春的旗号肆意妄为，自己不想与他们同流合污，秉持着“现充都去爆炸吧”的理念惶惶度日，所以至今没有朋友。生活指导平冢老师发现了八幡的消极生活态度，将他带到了学校的侍奉部，而这里的部长则是学校 美少女雪乃。从此，嬉笑怒骂的青春恋爱生活就此展开。'),
('9787535639103', '成田良悟', '无头骑士异闻录1-13', 6, 328.00, '每个城市的每个角落都有属于自己的城市传说，位于东京的池袋也不例外。这里聚集了追求不平凡的少年，YX善良又老实的少女，以收集情报为乐的青年，专治疑难病患的医生，还有一个来自爱尔兰神话的无头骑士……这些各式比寻常的人物在池袋这一都市舞台上展开了一连串“日常”的爱情悬疑故事……'),
('9787534050671', '米二', '一人之下系列 1-15册', 7, 263.50, '本漫画讲述的是“异人”的故事，可谓是东方“X战警”。故事的男主人公张楚岚是一个隐藏在普通人之中的异人。在人生的前19年中，他一直小心隐藏着自己和别人的不同。直到有*天，他爷爷的遗体被盗，神秘少女冯宝宝突然造访，平静的校园生活被接二连三出现的异能人士彻底颠覆，而他也被卷入到前所未见的麻烦之中……'),
('9787505622623', '久保带人', '死神境界画集', 8, 43.00, '久保带人，本名久保宣章。日本漫画家，人气动漫《BLEACH》的作者。 高校3年级时投稿，即被编辑留意。久保在少年漫画中独树一帜的标志性风格是作品的语言异常的漂亮，显露出很深的文字功底。2001年开始在集英社周刊《少年Jump》上连载《BLEACH》至今。'),
('9787513330022', '荒木飞吕彦', '荒木飞吕彦的漫画术', 9, 58.00, '《荒木飞吕彦的漫画术》是漫画大师荒木飞吕彦的创作公开课，以销量破亿代表作《JOJO的奇妙冒险》为例，首度披露创作秘诀。\r\n\r\n如何用首页紧紧抓住读者的心？如何避免创意枯竭？如何不露痕迹地植入丰富的信息？荒木飞吕彦倾尽30年漫画生涯珍贵经验，以《JOJO》及《龙珠》《阿基拉》等经典漫画为例，剖析塑造角色、构建剧情、打造世界观等关键环节，讲解创意实践的黄金法则。\r\n\r\n同时收录40余幅手绘画作，封面由作者亲绘自画像与经典角色，堪称大师级创作课程，不仅是想成为漫画家的人，从事创意的人都应该读一读。'),
('9787516811528', ' 长月达平', '从零开始的异世界生活 全套11册', 10, 233.00, '高中生菜月昴从便利店回家的途中，突然被召唤到异。在危急关头，一名神秘的银发美少女和猫精灵拯救了他。以报恩为名义，昴自告奋勇地帮少女寻找失物。然而，好不容易掌握了线索，昴和少女却遭到不明人物的袭击而丧命。本该就此死去，昴回过神来，却发现自己身在刚被召唤到这个异时的位置。毫无实力的少年得到的*能力就是“死亡回归”——在他死后，时间会回溯到初……'),
('9787534065361', '尾田荣一郎', '海贼王漫画书全套第81+82全2册', 11, 23.00, '时值大海盗时代，为了寻找传说中海盗王G(高路德)·罗杰所留下的大秘宝“ONE PIECE”，无数海盗扬起旗帜，互相争斗。有一个梦想成为海盗的少年叫路飞，他非常崇拜滞留在村庄里的海盗团首领杰克斯，但是有一天，他误食了海盗们的战利品“恶魔之果”，拥有了超乎常人的奇异能力，成为了橡皮人，其代价便是一辈子无法游泳。之后没多久，由于山贼与海盗的恩怨，想替杰克斯出头的路飞被山贼劫持为人质，还被丢进了海中，就在不会游泳的路飞快要被海怪吃掉的时候，杰克斯挺身而出救了他，但是付出了一只手的沉重代价……'),
('9787505631090', '岸本齐史', ' 火影忍者 卷1-72', 12, 822.40, '从小身上封印着邪恶的九尾妖狐，无父无母的鸣人受尽了村里人的冷落，但是他却不知道原因，只是拼命用各种恶作剧试图吸引大家的注意，人们却反而更加远离他。好在还有伊鲁卡老师关心他，鸣人的性格才没有变得扭曲。他总是干劲十足，嘻嘻哈哈，超级乐观。为了让更多的人认可自己，鸣人的目标是——成为火影！'),
('9787539768724', '加藤和惠', '青之驱魔师漫画 1-13册 套装共13本', 13, 168.00, '这个*界拥有两个次元，一侧是我们所居住的“物质界”,另一侧是恶魔所居住的“虚无界”。心有邪念的人就很适合成为恶魔的凭依，而驱魔师的职责就是保护人们不受恶魔的侵袭。少年奥村燐发现自己竟然是撒旦之子。养父藤本神父因保护自己，而被撒旦附身后离世。为对抗自身是恶魔撒旦之子的命运，并替已身亡的养父藤本神父报仇，向撒旦证明自己的存在，奥村燐毅然决定成为一位出色的驱魔师。为打败他的生父撒旦，正式加入了正十字骑士团，用他那自身的蓝色火炎之力量向撒旦复仇，从而展开了驱魔师之旅。'),
('9787505625945', '空知英秋', '银魂漫画书 全集1-64册', 14, 555.00, '空知英秋（1979年5月25日—），日本著名漫画家，出生于北海道，身高为162cm，血型为AB型。在集英社的《周刊少年Jump》上活动，代表作品为《银魂》。2002年，于《周刊少年Jump》上刊登作品《蒲公英》出道，2003年，同样在《周刊少年Jump》上发表作品《白黑》，2004年，《银魂》开始连载，至今获得大量人气。'),
('9789869611107', '鬼灭之刃14', '鬼灭之刃动漫画同人周边同款海报挂件卡片明信片画册礼包手办画集', 15, 23.00, '原本分裂成各种感情的鬼半天狗，除了本体以外都合而为一攻击炭治郎！半天狗指责炭志郎欺负「弱者」，让陷入苦战的炭志郎相当愤慨？另一方面，霞柱时透找回过去的记忆，与玉壶对峙。结果时透身上出现了变化？');

-- --------------------------------------------------------

--
-- 表的结构 `doc`
--

CREATE TABLE `doc` (
  `title` varchar(50) NOT NULL,
  `creat_date` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `hot` int(11) DEFAULT '0',
  `cont` text NOT NULL,
  `docid` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `doc`
--

INSERT INTO `doc` (`title`, `creat_date`, `hot`, `cont`, `docid`) VALUES
('《我的青春恋爱物语果然有问题》结局已定，第14卷2019年“初”发售', '2019-11-26 16:00:00', 42, ' 前些天（11月20日）《我的青春恋爱物语果然有问题》第13卷已经发售，当时就有网友早早守在书店前，第13卷一经发售就拍下了全卷的插图。<br><br>\r\n\r\n       光光看着插图，就能嗅到空气中浓烈的硝烟味。特别是卷首全彩绘，女生一字排开，大老师手捧花束。这花束到底意味着什么呢······<br><br>\r\n\r\n       第二张则是仿照《白色相簿》的镜头，看着就胃疼。<br><br>\r\n       而在昨天的生放送中，《我的青春恋爱物语果然有问题》的作者渡航表示，这本小说本来是为了致敬《我的朋友很少》而写的，而结局在最开始就早已定好，如今也没有打算变更。<br><br>\r\n\r\n       问及14卷目前进度时，渡航坦言目前还没有动笔，但预定在2019年“初”发售这系列的完结卷。<br><br>\r\n       渡航不枉写小说这么多年，一个2019年“初”这个“初”用的就非常精髓。可一想到自己最喜欢的的小说之一就要完结，小编心里那叫一个苦啊。然后一想到结局就感觉更苦了。渡航说《我的青春恋爱物语果然有问题》（2011年）致敬《我的朋友很少》（2009年），而那边的结局算是团灭。<br><br>\r\n       哎，大老师啊，至少选个人吧。平冢静老大不小了，你收了也好。<br><br>\r\n\r\n       没准真的是老是呢？毕竟大老师手捧鲜花的朝着外边，而图中没有老师，所以实锤！（不过也可能只是送行。）总之希望能有个Happy End吧！<br><br>', 1),
('《银魂》7月8日再开，这次真的要完结了', '2019-11-26 16:00:00', 10, '银魂》动画目前更新到354集，漫画更到了684话。今年能看到《银魂》动画更新真的很惊喜，可是随着《银魂》宣告这是最终章的时候真的很难过。<br><br>\r\n真是充满惊喜与感伤的一月份，马上要迎来泪目的七月。《银魂》，你让我们怎么办才好？看了这么多动漫，最爱的依然是《银魂》，虐腹又虐心，节操什么的，丢掉好了啊。可恶，怎么能完结呢？<br><br>\r\n   《银魂》动画讲到天人和地球发生大战，真选组回归，与万事屋、歌舞伎町一条街一起守护江户。地球危在旦夕，双方都伤亡惨重。每一个人都在拼命守护江户，守护地球。源外老爹研制的能制衡机械的武器令天人忌惮，于是源外老爹被抓走。这次银他妈要讲到虚了吧。这场战争本就是由虚引起的，是一场阴谋。<br><br>\r\n    我看了一些漫画，突然觉得虚很可怜，无穷无尽的生命、欲灭而不能的痛苦。虚的目的是要毁灭所有，借地球的力量与阿鲁塔纳的力量相互作用达到毁灭自己的目的。还是等待银魂播出的时候好好看吧，剧透了就不好了，毕竟挺多人不看漫画的。\r\n<br><br>   这个暑假就承包给《银魂》吧，依然是深夜档，凌晨1:35。明明是没有节操的动漫，却总是牵动我们的心。就是喜欢银他妈的无节操，就是喜欢他让我们又哭又笑的情节。可是这样的日子又能剩多少，万事屋，请接下我们的委托，拜托银他妈不要完结。好吧，这是不可能的。<br><br>\r\n就让我们陪伴《银魂》直至终结吧，再见，银桑！', 2),
('《海贼王》和之国再次变装，观众直呼过瘾', '2019-11-26 16:00:00', 19, '《海贼王》上周日更新的第911集《打倒四皇，绝密讨伐作战启动》，想必各位看官已经看过了吧，这一集可谓是大吸眼球，锦卫门的“妖术”再次上线，他的作品让所有的海米们高声欢呼，为什么呢？因为在这一集中路飞等人的服装又一次的发生改变，那么，我们来分析一下他们的服装效果。<br><br>\r\n重要的事情说三遍:最好看的在最后，最好看的在最后，最好看的在最后。<br><br>\r\n说到锦卫门的妖术，其实应该是一种恶魔果实的能力，和之国之前不是处于闭关锁国的状态吗，然后锦卫门还是20年前穿越过来的，消息阻塞，不知道这是恶魔果实，变称之为“妖术”，这一集锦卫门为了不让路飞一伙的着装暴露秘密计划，便使用能力将他们换了一身衣服。<br><br>\r\n参与变装的有山治、布鲁克、乔巴、娜美和加洛特。', 3),
('《Re:从零开始的异世界生活-INFINITY》无尽的爱与挑战', '2019-11-27 16:00:00', 32, '<p>由超人气动画《从零开始的异世界生活》改编的同名正版手游即将上线！美丽善良的银发少女爱蜜莉雅、可爱双胞胎姐妹雷姆拉姆，重要的伙伴们一一登场。在无数次[死亡轮回]之后，异世界又会发生怎样的全新故事呢？无尽的爱与挑战，从零开始的异世界冒险即将开启。</p><br><br>\r\n<p>《Re：从零开始的异世界生活-INFINITY》正版手游的首次线下亮相,展台将整体采用Minimalism风格，呈半圆形舞台，并在顶部设有动画中让人记忆深刻的白鲸原型。整体装饰穿插各种动画场景中的元素，让大家沉浸到熟悉的异世界氛围中。展台涵盖舞台表演、抽奖互动、COSER互动以及手办展示等区域。初入异世界的苹果摊大叔，美丽的爱蜜莉雅和可爱的双胞胎姐妹雷姆、拉姆都将在展台与大家见面。</p><br><br>\r\n<p>当然，在漫展现场上最最重要的美少女会面必不可少。对于《Re：从零开始的异世界生活-INFINITY》手游的首次亮相，我们不仅邀请了荣小兔头、兰幼金、只是简言、刘二二同学、阮小七seven和高笑笑等多位高人气coser前来助阵，开启场内巡游，让大家有机会近距离和喜欢的coser合影留恋；还特邀知名唱见三畿道、MASA、祈inory、凑诗倾情献唱；萌爱moi、兰幼金、幽灵、荣小兔头、欣小萌有点污等二次元舞姬进行现场舞蹈表演。</p>', 4),
('《多罗罗》第一集：这13个隐藏细节你都发现了吗？', '2019-01-06 16:00:00', 14, '<p>不得不说，新番《多罗罗》满足了我的期待，op/ed好听到爆，作画打斗分镜也很给力，是刷了一遍可以刷第二遍的呀！  首先《多罗罗》改编自漫画，很大程度上还是尊重了原著的。看了第一集后的感觉，可能动画比漫画更好一些！</p><br><br>\r\n<p>为什么这么说呢？就第一集来说，它相比漫画好在以下几点：\r\n</p><br><br>\r\n<p> 1.补全漫画设定。漫画有的地方考虑并不周全，但是动画明显补全了。<br><br>\r\n  比如多罗罗在漫画中被48魔神剥夺了48个部位，其一数量太多，百鬼丸这打怪升级之路会漫漫修远，而且哪里去找48器官来分配？减少数量对于后面情节发展比较友好。其二，48部位被剥夺，声带算其中之一，应该不能正常出声。但是漫画见到多罗罗的时候他就说话了声音并未受损。所以动画中一开始不能说话补全此设定。\r\n</p><br><br>\r\n<p>有人问为什么第一个魔神如此之弱？这里也明显是动画为补全漫画设定。按照漫画第一个魔神出现在万代之卷的万代身上，而漫画中一出场百鬼丸就没戴面具，皮肤作为人体分部面积最大的器官，不被魔神夺走这一点漫画bug由动画这堆垃圾淤泥妖怪作为魔神而补全。不过按照日漫弱者先出给主角练级的一般性定律，还是在我接受范围内的。</p><br><br>\r\n<p>  2.尊重原作。这种尊重并不是百分百照搬，而是在大致跟原著走的基础上进行修改和完善。  剧情和第一卷没有根本上改动，这对我们这些漫画党很友好。画风上改动得符合大众审美之后里面人物的基本特征并未改变。比如百鬼丸原著的头发虽然很写意，但形状就基本是动画这样，法师（动画里称作“琵琶丸”）琵琶藏剑，双目失明且有一层眼翳，动画里也保留了。 另外醍醐景光、多宝丸和母亲大人的形象也基本保留了原著一些比较显著得特征</p><br><br>\r\n<p>3.增加伏笔，做好铺垫。  比如法师（琵琶丸）漫画从法师之卷百鬼丸长大后才出场，但是这里婴儿之后就出场了，更说明一种因果，并且也为之后的法师之卷做更好的引导。  比如百鬼丸吸引恶鬼的体质是从被魔神剥夺去了身体之后就有的，也这就说明为什么百鬼丸在的地方妖魔横行。<br><br>\r\n  比如寿海和多宝丸提前出场，寿海在为亡者补全身体，暗示了他和百鬼丸的关系。多宝丸要去为母亲大人炖汤，但是母亲大人却眉头未展，心事重重，这也为后来多宝丸见到百鬼丸之后的事做铺垫。</p><br><br>\r\n<p>4.丰满人物，塑造更有深度的人设。  比如上人，在漫画里他就是一个完全没什么存在感的引导角色，但是在动画增加了他介于佛和魔之间的摇摆，更表现战乱时代人心的恐慌，也表现他对于坚持神佛的疑问，同时也表现他在堕魔前最后的挣扎。</p>', 6),
('文豪野犬 bones改编的电视动画', '2020-01-16 09:18:58', 37, '正篇（#1—#12、#17—#25） 被孤儿院赶出、濒临饿死边缘的少年·中岛敦与一群风格奇异的男人们相遇了—— 热衷于大白天跳水自杀、有着自杀嗜好的男子·太宰治。 总是神经质地翻阅手帐的、戴着眼镜的男子·国木田独步。 他们是、能解决连军队和警察都束手无策的怪异事件的“武装侦探社”的成员。 \r\n<br><br>因为某种原因，敦被要求一起同行去击退使街道巷尾都骚动不已的“食人虎”…… 架空的都市 横滨。怀有文豪之名的人物、登场。借此之名各类异形的力量如火花四散。 千奇百怪的文豪异能力战斗，在这里开幕！<br><br>\r\n [6]  黑之时代篇（#13—#16） 拥有非同常人的“异能”之力，盘踞于横滨黑社会的恶徒，其名为“港口黑手党”。 最年少干部·太宰治、最下级成员·织田作之助、秘密情报员·坂口安吾。 身在看重阶级的组织中，却跨越了立场相交的3人，今夜也在微暗的酒吧吧台并肩畅饮。 直到，其中一人断绝消息的那一天…… 男人为了追求什么而成为黑手党，又是失去了什么而与之诀别？ \r\n<br><br>代替不去敞开胸怀的他们所书写下的一页写真。 书写下，黑之时代，在黑暗中闪光的“某物”。 这是，太宰治加入“武装侦探社”之前的故事—— <br><br>\r\n[7]  十五岁篇（#26—#28） “武装侦探社”和“港口黑手党”拥有能使用非常人的“异能”之力的使用者。现在的横滨，两个组组展开着激烈交锋。 追溯至七年前—— 港口黑手党的首领·森鸥外听到了烦人的谣言。据说本已吊丧的前任首领在港区附近的贫民窟现身。十五岁的太宰治被命令去调查，这是他的首次任务。 太宰来到了贫民窟，遇到了和港口黑手党敌对的反势力“羊”的老大·中原中也。神兽让怨恨的亡者从地狱复苏，隐藏于愤怒的火焰之中，无法说出的真相是……？ 后来，还没有对上名字，年轻的原石们就轰动了黑社会。无垢的羊为何要沾染黑暗？ 这是“双黑”开始的故事。<br><br>\r\n [8]  正篇（#29—） 白虎与黑兽——中岛敦与芥川龙之介并肩作战，在与弗朗西斯·F的决战中得胜，与自大国袭来的“组合（Guild）”之间的巨大异能战争宣告结束。 “武装侦探社”与“港口黑手党”在此战中缔结的休战协定仍在继续，而从他们引发的毁灭危机中幸存下来的横滨，今天也在路边上演名为日常的故事。 但海外犯罪组织流入的传言，以及“组合（Guild）”残党的影子仍在此地若隐若现…… 另一方面，太宰治对于“魔人”觉醒、新的灾厄开始感到担忧。 在暗渠中蠢蠢欲动的，是盗贼团“死屋之鼠”的头目，费奥多尔·D。其令人恐惧的谋略，终于露出獠牙！！', 7),
('FATE正确观看顺序是什么', '2020-01-16 09:54:01', 102, '建议观看顺序：1->3->4->5->8->6->7  <br><br>\r\n先看1再看3有利于理解3的剧情 8能和1345有点联系 此外，还有一些外传可以随意看看： <br><br>\r\n1.幻想嘉年华 （Carnival Phantasm）（11年上映，云雀工作室制作） <br><br> 2.Fate/kaleid liner 魔法少女☆伊莉雅 TV版共4部（13年上映，漫改，SILVER LINK制作）  <br><br>\r\n3.Fate/kaleid liner 魔法少女☆伊莉雅剧场版：雪下的誓言（17年上映，SILVER LINK制作，魔伊前传）  <br><br>\r\n4.卫宫家今天的饭（18年上映，漫改，ufotable制作）<br><br>', 8);

-- --------------------------------------------------------

--
-- 表的结构 `music`
--

CREATE TABLE `music` (
  `M_id` int(11) NOT NULL,
  `M_title` text NOT NULL,
  `M_singer` varchar(20) NOT NULL DEFAULT '群星',
  `M_time` time(6) NOT NULL,
  `M_album` varchar(20) NOT NULL DEFAULT '未知',
  `M_belong` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `music`
--

INSERT INTO `music` (`M_id`, `M_title`, `M_singer`, `M_time`, `M_album`, `M_belong`) VALUES
(1, 'Never Had A Dream Come True', 'Studio Allstars', '00:03:57.000000', '未知', 'english'),
(2, 'I Hate Myself For Loving You', 'Joan Jett', '00:04:07.000000', '未知', 'english'),
(3, '1965', 'Zella Day', '00:03:37.000000', '未知', 'english'),
(4, 'Someone Like You', 'Adele', '00:04:45.000000', '未知', 'english'),
(5, 'The Dragonborn Comes', 'Erutan', '00:03:14.000000', 'Skyrim', 'game');

-- --------------------------------------------------------

--
-- 表的结构 `notice`
--

CREATE TABLE `notice` (
  `notice_id` int(11) NOT NULL,
  `content` varchar(500) NOT NULL,
  `create_date` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `notice`
--

INSERT INTO `notice` (`notice_id`, `content`, `create_date`) VALUES
(4, 'web5.0是web4.0之后，在web4.0的基础上引入了大量的bootstrap技术的新一代网站. 增加了可缩放导航栏', '2020-05-17 14:57:58'),
(5, 'web6.0优化了背景动画和播放器界面，具有动态化管理，页面动态化等新特性', '2020-05-17 14:58:11'),
(6, 'web6.0是web5.0之后，带有PHP后台，完全基于bootstrap 的全新版本。', '2020-05-17 14:58:22'),
(7, 'web7.0 vue 重构版终于要来啦，doing the job .jpg ，正在做了.jpg', '2020-05-17 15:08:57'),
(8, '来注册吧\r\n', '2020-09-14 18:10:30');

-- --------------------------------------------------------

--
-- 表的结构 `order_item`
--

CREATE TABLE `order_item` (
  `order_id` int(10) NOT NULL,
  `user_id` varchar(20) NOT NULL,
  `goods_title` varchar(50) NOT NULL,
  `goods_id` int(10) NOT NULL,
  `goods_num` int(4) NOT NULL,
  `goods_price` double(20,2) NOT NULL,
  `sum_price` mediumint(9) NOT NULL,
  `addrees` varchar(25) NOT NULL,
  `tracke_number` varchar(50) DEFAULT NULL,
  `status` tinyint(4) NOT NULL DEFAULT '1',
  `creat_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `order_item`
--

INSERT INTO `order_item` (`order_id`, `user_id`, `goods_title`, `goods_id`, `goods_num`, `goods_price`, `sum_price`, `addrees`, `tracke_number`, `status`, `creat_time`, `update_time`) VALUES
(39, '18144439345', '青之驱魔师漫画 1-13册 套装共13本', 13, 1, 168.00, 168, '请按时地方安慰色的日方提供和斯蒂芬规划局阿斯顿飞过', NULL, 3, '2020-03-01 15:50:25', '2020-03-01 15:55:50'),
(40, '18144439345', '从零开始的异世界生活 全套11册', 10, 1, 233.00, 233, '请按时地方安慰色的日方提供和斯蒂芬规划局阿斯顿飞过', NULL, 3, '2020-03-01 15:52:53', '2020-03-13 05:23:20'),
(42, '18144439345', '我的青春恋爱物语喜剧果然有问题全套', 5, 1, 229.00, 229, '请按时地方安慰色的日方提供和斯蒂芬规划局阿斯顿飞过', NULL, 2, '2020-03-01 15:53:12', '2020-03-13 05:13:53'),
(43, '18144439345', '青之驱魔师漫画 1-13册 套装共13本', 13, 1, 168.00, 168, '18144439345', NULL, 2, '2020-03-12 21:25:36', '2020-03-13 05:13:58'),
(44, '18144439345', '鬼灭之刃动漫画同人周边同款海报挂件卡片明信片画册礼包手办画集', 15, 1, 23.00, 23, '广东海洋大学', NULL, 1, '2020-03-13 05:04:00', '2020-03-13 05:04:00'),
(62, '147258369', '青之驱魔师漫画 1-13册 套装共13本', 13, 1, 168.00, 168, '233路233街233巷233号', NULL, 1, '2020-09-14 17:31:30', '2020-09-14 17:31:30'),
(63, '147258369', '银魂漫画书 全集1-64册', 14, 1, 555.00, 555, '233路233街233巷233号', NULL, 1, '2020-09-14 17:31:44', '2020-09-14 17:31:44'),
(64, '147258369', '银魂漫画书 全集1-64册', 14, 1, 555.00, 555, '233路233街233巷233号', NULL, 1, '2020-09-14 17:34:31', '2020-09-14 17:34:31'),
(65, '147258369', '银魂漫画书 全集1-64册', 14, 1, 555.00, 555, '233路233街233巷233号', NULL, 1, '2020-09-14 17:58:18', '2020-09-14 17:58:18');

-- --------------------------------------------------------

--
-- 表的结构 `shop_cart`
--

CREATE TABLE `shop_cart` (
  `id` int(5) NOT NULL,
  `user_account` varchar(20) NOT NULL,
  `goods_id` int(10) NOT NULL,
  `num` int(10) NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT '1',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updata_time` timestamp(6) NOT NULL DEFAULT '0000-00-00 00:00:00.000000' ON UPDATE CURRENT_TIMESTAMP(6)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `shop_cart`
--

INSERT INTO `shop_cart` (`id`, `user_account`, `goods_id`, `num`, `status`, `create_time`, `updata_time`) VALUES
(77, '18144439345', 3, 5, 0, '0000-00-00 00:00:00', '2020-09-12 15:12:41.916457'),
(78, '18144439345', 13, 4, 0, '0000-00-00 00:00:00', '2020-09-12 15:12:44.950382'),
(79, '18144439345', 15, 5, 0, '0000-00-00 00:00:00', '2020-09-12 15:12:47.226329'),
(88, '13030297887', 12, 6, 0, '0000-00-00 00:00:00', '2020-09-12 01:38:18.521611'),
(89, '13030297887', 8, 5, 0, '0000-00-00 00:00:00', '2020-09-12 01:38:50.344166'),
(90, '13030297887', 6, 3, 0, '0000-00-00 00:00:00', '2020-09-12 01:38:30.738034'),
(91, '17156868693', 13, 1, 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00.000000'),
(92, '17156868693', 2, 1, 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00.000000'),
(93, '17156868693', 5, 1, 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00.000000'),
(101, '147258369', 4, 3, 0, '0000-00-00 00:00:00', '2020-09-14 06:10:44.474408'),
(105, '147258369', 9, 1, 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00.000000'),
(106, '147258369', 12, 1, 0, '0000-00-00 00:00:00', '0000-00-00 00:00:00.000000');

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE `user` (
  `user_id` int(10) NOT NULL,
  `user_account` varchar(20) NOT NULL,
  `user_name` varchar(10) DEFAULT '佚名',
  `password` varchar(20) NOT NULL,
  `user_sex` varchar(10) DEFAULT '猛男百分百',
  `user_addrees` varchar(25) DEFAULT NULL,
  `user_sign` varchar(200) DEFAULT '这个人很懒，什么也没有留下',
  `has_head` tinyint(1) DEFAULT '0',
  `user_birthday` varchar(15) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user`
--

INSERT INTO `user` (`user_id`, `user_account`, `user_name`, `password`, `user_sex`, `user_addrees`, `user_sign`, `has_head`, `user_birthday`) VALUES
(3, '18144439345', '六饭堂主', '18144439345', '男', '广东 广州市', '哈哈哈哈哈哈哈哈哈哈', 1, NULL),
(4, '17156868693', '梁朝靖', '2431299', '男', '广东 中山市', '蛤蛤蛤蛤蛤蛤蛤蛤蛤蛤蛤蛤蛤蛤蛤蛤', 1, ''),
(5, '13030297887', '进击的阿饭', '13030297887', '男', '广东 湛江市', '哈哈哈哈哈哈，神经病', 1, ''),
(6, '147258369', '风暴击倒大树', '123456789', '男', '山东 日照市', '是个憨憨', 1, '');

-- --------------------------------------------------------

--
-- 表的结构 `user_addrees`
--

CREATE TABLE `user_addrees` (
  `user_account` varchar(20) NOT NULL,
  `receior` varchar(15) NOT NULL,
  `area` varchar(15) NOT NULL,
  `addrees` varchar(25) NOT NULL,
  `telephone` varchar(15) NOT NULL,
  `addrees_id` int(11) NOT NULL,
  `postal_code` varchar(6) NOT NULL DEFAULT '0'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user_addrees`
--

INSERT INTO `user_addrees` (`user_account`, `receior`, `area`, `addrees`, `telephone`, `addrees_id`, `postal_code`) VALUES
('18144439345', '六饭堂主', '广东湛江', '广东海洋大学', '18144439345', 70, '000000'),
('18144439345', '啊饭', '广东云浮', '荔湾区洪石坊洪石坊菜鸟驿站153号', '18144439345', 71, '000000'),
('18144439345', '梁朝靖', '江苏 盐城市', '荔湾区洪石坊洪石坊菜鸟驿站153号', '12345678910', 77, '000000'),
('18144439345', 'english菜', '台湾 高雄市', '东风21号', '12345678910', 78, '000000'),
('18144439345', '李瓜皮', '河北 石家庄市', '李瓜皮的移动城堡', '14725836900', 83, '000000'),
('13030297887', '啊饭', '广西 来宾市', '心怡路新一街和平大道250号', '13030297887', 84, '000000'),
('147258369', '巨人尤姆', '广东 中山市', '233路233街233巷233号', '120201121', 85, '000000');

-- --------------------------------------------------------

--
-- 表的结构 `user_comment`
--

CREATE TABLE `user_comment` (
  `comment_id` int(11) NOT NULL,
  `user_id` varchar(20) NOT NULL,
  `user_account` varchar(12) NOT NULL,
  `user_comment` varchar(200) NOT NULL,
  `creat_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `doc_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `user_comment`
--

INSERT INTO `user_comment` (`comment_id`, `user_id`, `user_account`, `user_comment`, `creat_time`, `doc_id`) VALUES
(1, '3', '18144439345', '来一发测试的评论吧', '2020-01-22 10:26:28', 8),
(8, '3', '18144439345', '插入测试', '2020-02-02 01:41:00', 7),
(30, '3', '18144439345', '我永远喜欢团子.jpg', '2020-02-02 03:30:36', 1),
(35, '3', '18144439345', '哈哈', '2020-09-10 17:09:35', 8),
(39, '4', '17156868693', '测个头', '2020-09-10 20:27:24', 7),
(40, '4', '17156868693', '来留言吧', '2020-09-10 20:43:30', 8),
(41, '5', '13030297887', '楼下两个都是我的小号', '2020-09-10 20:49:14', 7),
(59, '5', '13030297887', '阿巴阿巴阿巴', '2020-09-10 21:31:40', 8),
(60, '6', '147258369', '2020年10月团子股已经炸了', '2020-09-13 22:14:27', 1),
(62, '6', '147258369', '爱仕达多，。、。，、z.x,c<></body></body>', '2020-01-14 17:56:22', 8);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `user_account` (`user_account`);

--
-- Indexes for table `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`catid`),
  ADD UNIQUE KEY `isbn` (`isbn`);

--
-- Indexes for table `doc`
--
ALTER TABLE `doc`
  ADD UNIQUE KEY `id` (`docid`),
  ADD KEY `doct` (`title`);

--
-- Indexes for table `music`
--
ALTER TABLE `music`
  ADD PRIMARY KEY (`M_id`),
  ADD UNIQUE KEY `M_id` (`M_id`),
  ADD KEY `M_id_2` (`M_id`);

--
-- Indexes for table `notice`
--
ALTER TABLE `notice`
  ADD PRIMARY KEY (`notice_id`);

--
-- Indexes for table `order_item`
--
ALTER TABLE `order_item`
  ADD PRIMARY KEY (`order_id`);

--
-- Indexes for table `shop_cart`
--
ALTER TABLE `shop_cart`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`user_id`),
  ADD UNIQUE KEY `user_account` (`user_account`);

--
-- Indexes for table `user_addrees`
--
ALTER TABLE `user_addrees`
  ADD PRIMARY KEY (`addrees_id`);

--
-- Indexes for table `user_comment`
--
ALTER TABLE `user_comment`
  ADD PRIMARY KEY (`comment_id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `admin`
--
ALTER TABLE `admin`
  MODIFY `user_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- 使用表AUTO_INCREMENT `books`
--
ALTER TABLE `books`
  MODIFY `catid` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;
--
-- 使用表AUTO_INCREMENT `doc`
--
ALTER TABLE `doc`
  MODIFY `docid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
--
-- 使用表AUTO_INCREMENT `music`
--
ALTER TABLE `music`
  MODIFY `M_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;
--
-- 使用表AUTO_INCREMENT `notice`
--
ALTER TABLE `notice`
  MODIFY `notice_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
--
-- 使用表AUTO_INCREMENT `order_item`
--
ALTER TABLE `order_item`
  MODIFY `order_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=66;
--
-- 使用表AUTO_INCREMENT `shop_cart`
--
ALTER TABLE `shop_cart`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=107;
--
-- 使用表AUTO_INCREMENT `user`
--
ALTER TABLE `user`
  MODIFY `user_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;
--
-- 使用表AUTO_INCREMENT `user_addrees`
--
ALTER TABLE `user_addrees`
  MODIFY `addrees_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=86;
--
-- 使用表AUTO_INCREMENT `user_comment`
--
ALTER TABLE `user_comment`
  MODIFY `comment_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=63;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
